Repository: andgein/drapo
Catalog: src/web/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Select team
ru: Выбрать команду

source: Invite hash
ru: Хеш приглашения

source: Category name
ru: Название категории

source: Description
ru: Описание

source: Name
ru: Название

source: Short description
ru: Короткое описание

source: Shows on main page
ru: Показывается на главной странице

source: Full description. Supports MarkDown
ru: Полное описание. Поддерживается MarkDown

source: Visible in list?
ru: Виден в списке

source: Participation mode
ru: Режим участия

source: Start
ru: Начало

source: Contest start time
ru: Время начала соревнования

source: Finish
ru: Конец

source: Contest finish time
ru: Время окончания соревнования

source: Registration start
ru: Начало регистрации

source: Contest registration start time, only for open and moderated registrations
ru: Время начала регистрации на соревновование. Только для открытой и модерируемой регистрации

source: Registration finish
ru: Конец регистрации

source: Contest registration finish time, only for open and moderated registrations
ru: Время окончания регистрации на соревнование. Только для открытой и модерируемой регистрации

source: Task grouping
ru: Группировка заданий

source: Enable categories or list all tasks one by one
ru: Включить категории или перечислить задания одно за другим

source: Tasks opening policy: next task opening
ru: Политика открытия заданий: открывается следующее

source: No
ru: Нет

source: Only for team who solved the task
ru: Только для команды, которая решила задание

source: Task will be open for everyone
ru: Задание откроется для всех

source: Tasks opening policy: manual
ru: Политика открытия заданий: вручную

source: Can admins open tasks manually for everyone or one participant
ru: Могут ли администраторы открывать задания вручную для всех или конкретного участника

source: Yes
ru: Да

source: Link
ru: Ссылка

source: Link to user or team for registering to the contest. I.e. http://drapo.io/users/1
ru: Ссылка на пользователя или команду для регистрации в соревновании. Например, http://drapo.io/users/1

source: Shows on tasks page
ru: Показывается на странице с заданиями

source: Max score
ru: Максимальный балл

source: Title
ru: Заголовок

source: Statement title. Supports markdown and substitutes
ru: Заголовок условия. Поддерживается markdown и подстановки

source: Template
ru: Шаблон

source: Statement template. Supports markdown and substitutes
ru: Шаблон условия. Поддерживается markdown и подстановки

source: Files
ru: Файлы

source: Files will be attached to the statement. Up to 10 files
ru: Файлы будут прикреплены к условию. До 10 файлов

source: Answer
ru: Ответ

source: Is case sensitive
ru: Регистрозависимый

source: Pattern
ru: Шаблон

source: Regular expression for matching, don't need ^ and $
ru: Регулярное выражение, без ^ и $

source: Ignore case
ru: Игнорировать регистр

source: Multiline
ru: Многострочный

source: Dot (.) includes newline character
ru: Точка включает символ перевода строки

source: Verbose
ru: Режим verbose

source: Search
ru: Искать

source: Text
ru: Текст

source: Supports markdown
ru: Поддерживает markdown

source: Is published
ru: Опубликовано

source: Publish time
ru: Время публикации

source: Finished
ru: Закончено

source: Running
ru: Идёт

source: You are registered to the contest
ru: Вы зарегистрированы на соревнование

source: You are waiting for approving by organizers
ru: Ваша регистрация ожидает подтверждения

source: <nobr>as a <a href="%(participant.get_absolute_url)s">%(participant.name)s</a></nobr>'s member
ru: <nobr>как участник команды <a href="%(participant.get_absolute_url)s">%(participant.name)s</a></nobr>

source: Login
ru: Войти

source: or
ru: или

source: register
ru: зарегистрироваться

source: to join the contest
ru: чтобы присоединиться к соревнованию

source: You can
ru: Вы можете

source: register your team
ru: зарегистрировать команду

source: join some one
ru: присоединиться к существущей

source: Register to the contest
ru: Зарегистрироваться

source: Registration will open
ru: Регистрация откроется

source: Sorry, registration to the contest is closed already.
ru: К сожалению, регистрация завершена

source: Attempts
ru: Попытки

source: Participant
ru: Участник

source: Task
ru: Задание

source: Status
ru: Статус

source: No attempts found by this pattern.
ru: Попыток не найдено

source: Clear filter?
ru: Очистить поиск?

source: No attempts a while... Wait for answers by participants
ru: Попыток пока нет. Ожидает ответов от участников

source: Attempt id
ru: ID попытки

source: Correct
ru: Верно

source: Wrong
ru: Неверно

source: Not checked
ru: Непроверено

source: + Add news
ru: + Добавить новость

source: Registered teams
ru: Зарегистрированные команды

source: No teams
ru: Никто не зарегистрировался

source: a while, <a href="%(join_url)s">be the first</a>!
ru: <a href="%(join_url)s">будьте первым</a>!

source: Participants
ru: Участники

source: No participants
ru: Пока никто не зарегистрировался

source: Create contest
ru: Добавить соревнование

source: Create category
ru: Создать категорию

source: Add task
ru: Добавить задание

source: Text checker
ru: Сравнение со строкой

source: RegExp checker
ru: Сравнению с регвыром

source: Create task
ru: Добавить задание

source: Edit contest
ru: Редактировать соревнование

source: Save
ru: Сохранить

source: Edit attempt
ru: Редактировать попытку

source: Edit attempt by <a href="%(attempt.participant.get_absolute_url)s"><strong>%(attempt.participant.name)s</strong></a> for <a href="%(attempt.task.name.get_absolute_url)s"><strong>%(attempt.task.name)s</strong></a>
ru: Редактировать попытку <a href="%(attempt.participant.get_absolute_url)s"><strong>%(attempt.participant.name)s</strong></a> для <a href="%(attempt.task.name.get_absolute_url)s"><strong>%(attempt.task.name)s</strong></a>

source: Save (and mark as checked)
ru: Сохранить (и пометить проверенным)

source: Just save
ru: Просто сохранить

source: Edit category
ru: Редактировать категорию

source: Delete category
ru: Удалить категорию

source: Enter
ru: Войти

source: Scoreboard
ru: Результаты

source: You are participating
ru: Вы участвуете

source: Register for participation
ru: Зарегистрируйтесь для участия

source: No contests now, come later
ru: Пока нет контестов, зайдите позже

source: Checked?
ru: Проверено?

source: Score
ru: Балл

source: Public comment
ru: Публичный комментарий

source: Visible to participant
ru: Виден для участника

source: Private comment
ru: Приватный комментарий

source: Visible only to admins
ru: Виден только администраторам

source: Markdown with substitutes
ru: Markdown с подстановками

source: Correct answer
ru: Правильный ответ

source: Is answer case sensitive
ru: Является ли ответ регистрозависимым

source: Team name
ru: Название команды

source: Your team
ru: Ваша команда

source: Edit team
ru: Редактировать команду

source: Invite users to your team, send them the link
ru: Пригласите участников в вашу команду, отправив им ссылку

source: or give them invite hash
ru: или дайте им хеш приглашения

source: Captain can't leave the team.
ru: Капитан не может покинуть команду

source: You can also
ru: Вы также можете

source: leave the team
ru: покинуть команду

source: Members
ru: Участники

source: Captain
ru: Капитан

source: Leave team
ru: Покинуть команду

source: Remove member
ru: Убрать участника

source: Participated in
ru: Участвовала в

source: Team has not been participated in contests yet
ru: Команда ещё не участвовала в соревнованиях

source: Contests
ru: Соревнования

source: Teams
ru: Команды

source: Tasks
ru: Задания

source: Profile
ru: Профиль

source: Edit settings
ru: Настройки

source: Create team
ru: Создать команду

source: Logout
ru: Выйти

source: Register
ru: Зарегистрироваться

source: Email
ru: Эл. почта

source: Your email
ru: Эл. почта

source: Password
ru: Пароль

source: Enter password
ru: Введите пароль

source: Password again
ru: Ещё раз

source: Repeat password
ru: Повторите пароль

source: Username
ru: Имя пользователя

source: Enter username
ru: Введите имя пользователя

source: Enter email
ru: Почта

source: First name
ru: Имя

source: Your first name
ru: Ваше имя

source: Last name
ru: Фамилия

source: Your last name
ru: Ваша фамилия

source: Your username
ru: Ваше имя пользователя

source: Old password
ru: Старый пароль

source: Drapo is a CTF checksystem
ru: Drapo — платформа для CTF-соревнований

source: Developed and hosted by <a href="http://kaspersky.com">Kaspersky Lab</a>
ru: Разработано в <a href="http://kaspersky.com">Kaspersky Lab</a>

source: Contact us
ru: Напишите нам

source: Feel free to <a href="mailto:ctf@kasperksy.com">write us</a>
ru: <a href="mailto:ctf@kasperksy.com">Пишите нам</a> по любым вопросам

source: Time
ru: Время

source: Server timezone is %(TIME_ZONE)s %(TIME_ZONE|utcoffset)s
ru: Часовой пояс на сервере {{ TIME_ZONE }} {{ TIME_ZONE|utcoffset }}

source: Registration
ru: Регистрация

source: Edit your profile
ru: Редактировать профиль

source: You are
ru: Вы

source: member of
ru: Участник

source: and
ru: и

source: You are not any team's member
ru: Вы не входите ни в какую команду

source: is not any team's member
ru: не входит ни в какую команду

source: Register account
ru: Создать аккаунт

source: Join
ru: Зарегистрироваться
